### Terraform Plan Output Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  
  ```terraform

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fe-loadbalancer.azurerm_lb.azlb has changed
  ~ resource "azurerm_lb" "azlb" {
        id                   = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb"
        name                 = "fe-lb"
        tags                 = {
            "Component"   = "Frontend"
            "Region"      = "uk south"
            "Terraform"   = "true"
            "environment" = "dev"
        }
        # (5 unchanged attributes hidden)

      ~ frontend_ip_configuration {
            id                            = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/frontendIPConfigurations/myPublicIP"
            name                          = "myPublicIP"
          ~ outbound_rules                = [
              + "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/outboundRules/outboundNat",
            ]
            # (5 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine_scale_set.rsi-frontend-vmss will be updated in-place
  ~ resource "azurerm_linux_virtual_machine_scale_set" "rsi-frontend-vmss" {
      ~ custom_data                                       = (sensitive value)
        id                                                = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Compute/virtualMachineScaleSets/rsi-vmss-fe"
        name                                              = "rsi-vmss-fe"
        tags                                              = {}
        # (25 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.fe-loadbalancer.data.azurerm_resource_group.azlb will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "azlb" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "rsi-dev-rg"
      + tags       = (known after apply)
    }

  # module.fe-loadbalancer.azurerm_lb_rule.azlb[0] will be updated in-place
  ~ resource "azurerm_lb_rule" "azlb" {
      ~ disable_outbound_snat          = true -> false
        id                             = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/loadBalancingRules/http"
        name                           = "http"
        # (12 unchanged attributes hidden)
    }

  # module.nsg-fe.azurerm_network_security_rule.custom_rules[0] will be created
  + resource "azurerm_network_security_rule" "custom_rules" {
      + access                       = "Allow"
      + description                  = "Allow Local Networks"
      + destination_address_prefixes = [
          + "10.0.0.0/16",
        ]
      + destination_port_ranges      = [
          + "0-65535",
        ]
      + direction                    = "Inbound"
      + id                           = (known after apply)
      + name                         = "VirtualNetwork"
      + network_security_group_name  = "rsi-nsg-frontend"
      + priority                     = 101
      + protocol                     = "*"
      + resource_group_name          = "rsi-dev-rg"
      + source_address_prefixes      = [
          + "10.0.0.0/16",
        ]
      + source_port_range            = "*"
    }

  # module.nsg-fe.azurerm_network_security_rule.custom_rules[1] will be created
  + resource "azurerm_network_security_rule" "custom_rules" {
      + access                      = "Allow"
      + description                 = "AzureLoadBalancerAllowed"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "0-65535",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AzureLoadBalancer"
      + network_security_group_name = "rsi-nsg-frontend"
      + priority                    = 201
      + protocol                    = "Tcp"
      + resource_group_name         = "rsi-dev-rg"
      + source_address_prefix       = "AzureLoadBalancer"
      + source_port_range           = "*"
    }

  # module.nsg-fe.azurerm_network_security_rule.custom_rules[2] will be created
  + resource "azurerm_network_security_rule" "custom_rules" {
      + access                      = "Deny"
      + description                 = "default-deny"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "0-65535",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DENY"
      + network_security_group_name = "rsi-nsg-frontend"
      + priority                    = 4096
      + protocol                    = "Tcp"
      + resource_group_name         = "rsi-dev-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.rsi-vnet-fe.azurerm_subnet_route_table_association.vnet["frontend"] will be created
  + resource "azurerm_subnet_route_table_association" "vnet" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/routeTables/rsi-rt-fe"
      + subnet_id      = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/frontend"
    }

Plan: 4 to add, 2 to change, 0 to destroy.

  ```
  </details>
  
  *Pusher: @MartyFox, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Pull Request Plan`*